000700    01  :HEL:-GREETING.
000800        05  :HEL:-BEGIN-GREETING PIC X(5).
000900        05  FILLER         PIC X(1) VALUE SPACES.
001000        05  :HEL:-NAME-GREETING  PIC X(5).
001100        05  FILLER         PIC X(1) VALUE '!'.
