000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.  HELLO.
000300 DATA DIVISION.
000400*
000500    WORKING-STORAGE SECTION.
000600*
000700    01  HELLO-GREETING.
000800        05  BEGIN-GREETING PIC X(5).
000900        05  FILLER         PIC X(1) VALUE SPACES.
001000        05  NAME-GREETING  PIC X(5).
001100        05  FILLER         PIC X(1) VALUE '?'.
          01  NEW-GREETING REDEFINES HELLO-GREETING PIC X(12).
001200*
001300 PROCEDURE DIVISION.
001400 0000-MAIN.
001500     PERFORM 1000-INITIALIZE
           PERFORM 2000-PROCESS
           PERFORM 3000-END-PROGRAM
           .
      *
       1000-INITIALIZE.
000400     INITIALIZE HELLO-GREETING
           .
      *
       2000-PROCESS.
          PERFORM 2100-FIRST-GREETING
          PERFORM 2200-SECOND-GREETING
          .
     * 
       2100-FIRST-GREETING.
          MOVE 'HELLO' to BEGIN-GREETING
          MOVE 'WORLD' to NAME-GREETING
          DISPLAY HELLO-GREETING
          .
     *
       2200-SECOND-GREETING.
          MOVE 'HI TAMI!' TO NEW-GREETING.
          DISPLAY HELLO-GREETING
          .
     * 
       3000-END-PROGRAM.
          STOP RUN 
          .
000500     STOP RUN.
