000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.  HELLO1.
000300 DATA DIVISION.
000400*
000500    WORKING-STORAGE SECTION.
000600*
000700*   01  HELLO-GREETING.
000800*       05  ELLO-BEGIN-GREETING PIC X(5).
000900*       05  FILLER         PIC X(1) VALUE SPACES.
001000*       05  HELLO-NAME-GREETING  PIC X(5).
001100*       05  FILLER         PIC X(1) VALUE '?'.
      * 
              COPY "COPY1.COB" REPLACING ==:HEL:== BY ==WELCOME==.
      *
          01  NEW-GREETING REDEFINES WELCOME-GREETING PIC X(12).
001200*
001300 PROCEDURE DIVISION.
001400 0000-MAIN.
001500     PERFORM 1000-INITIALIZE
           PERFORM 2000-PROCESS
           PERFORM 3000-END-PROGRAM
           .
      *
       1000-INITIALIZE.
000400     INITIALIZE WELCOME-GREETING
           .
      *
       2000-PROCESS.
          PERFORM 2100-FIRST-GREETING
          PERFORM 2200-SECOND-GREETING
          .
     * 
       2100-FIRST-GREETING.
          MOVE 'HELLO' to WELCOME-BEGIN-GREETING
          MOVE 'WORLD' to WELCOME-NAME-GREETING
          DISPLAY WELCOME-GREETING
          .
     *
       2200-SECOND-GREETING.
          MOVE 'HI JIM!' TO NEW-GREETING.
          DISPLAY WELCOME-GREETING
          .
     * 
       3000-END-PROGRAM.
          STOP RUN 
          .
000500     STOP RUN.
